---
kind: other
id: AllMembers.T:Autodesk.Revit.Attributes.TransactionAttribute
source: html/7410e5b7-30ab-8fba-6898-51416d0a3a43.htm
---
# TransactionAttribute Members

Constructs a new TransactionAttribute.